Revit 2026 API

# TransformOfVector Method

---

Applies the transform to the vector

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ OfVector(
	XYZ vec
)
```
```vb
Public Function OfVector (
	vec As XYZ
) As XYZ
```
```cpp
public:
XYZ^ OfVector(
	XYZ^ vec
)
```
```fsharp
member OfVector :
        vec : XYZ -> XYZ
```

#### Parameters

vec XYZ
    The vector to be transformed

#### Return Value

XYZThe new vector after transform

Transformation of a vector is not affected by the translational part of the transformation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace